{
    "7a0152fa-86e7-4c92-8d18-e5b9182aa49f": {
        "bookTitle": "THE TRIVIA MAN",
        "imageUrl": "https://www.bookloverbookreviews.com/wp-content/uploads/2015/06/The-Trivia-Man-by-Deborah-OBrien-300x461.jpg?ezimgfmt=ngcb140/notWebP",
        "Author": "Deborah OBrien",
        "bookGenre": "Romance",
        "bookReview": "Who isnt drawn to a story about people that walk to the beat of their own drum? Every one of us has at some time in our lives felt that we didn’t quite fit in with the crowd, or perhaps admired those that appeared quite happy not doing so.Kevin Dwyer, The Trivia Man, is a smart guy, but his lack of understanding of social norms has left him isolated within society.O’Brien’s use of a narrative that alternates between different character viewpoints provides valuable insight on the subtle nuances at play in even the most common place of situations. And most crucially, the potential minefield ‘what is often unsaid’ can present for those who process the world literally.What I particularly admired is that O’Brien did not feel the need to shout her message. The Trivia Man is very pleasant read, slow burning and almost quiet, but its depth of meaning creeps up on you. Through entertaining dialogue during the weekly trivia competitions she develops her eclectic ensemble cast, slowly but surely stripping back layers.",
        "bookRating": "4",
        "_id": "7a0152fa-86e7-4c92-8d18-e5b9182aa49f"
    },
    "a9ebadfc-570c-43fc-a1fb-935f1d421050": {
        "bookTitle": "Let Us Descend",
        "imageUrl": "https://d1ldy8a769gy68.cloudfront.net/300/978/198/210/449/8/9781982104498.jpg",
        "Author": " JESMYN WARD",
        "bookGenre": "Romance",
        "bookReview": "Ward follows her award-winning Bois Sauvage trilogy (Where the Line Bleeds, 2008; Salvage the Bones, 2011; Sing, Unburied, Sing, 2017) by moving away from her native Mississippi and back in time to the rice fields of pre–Civil War North Carolina, where Annis, a bright young Black woman who has learned from her mother, enslaved like her, that the white man who owns her is also her father and his daughters (on whose school lessons about Aristotle and the social habits of bees she eavesdrops) are her sisters. Annis’ mother enhances the younger woman’s education with lessons in self-defense and survival tactics she carried with her from Africa, where, as she informs her daughter, her mother was a warrior queen. Annis will need all this inherited cunning and resilience after her “sire” sells her mother. Away from her chores, Annis finds solace from her lover, Safi, the bees carrying out their own chores in the nearby forest, and words from a poem about an “ancient Italian” descending into hell as intoned by her sisters’ tutor. After Safi flees the plantation, Annis and other slave women are herded like cattle and sent off on a long, grueling march further south. Along the way, Annis has her first encounter with a dynamic woman spirit bearing the name Mama Aza, an imperious and enigmatic guardian angel guiding and protecting Annis from the more malevolent spirits that endanger the women’s lives en route to the slave markets of New Orleans, which Annis likens to the “grief-racked city” of Dante’s poem. There’s little that Ward’s narrative contributes to the literature of American slavery in its basic historic details. But what gives this volume its stature and heft among other recent novels are the power, precision, and visionary flow of Ward’s writing, the way she makes the unimaginable horror, soul-crushing drudgery, and haphazard cruelties of the distant past vivid to her readers. Every time you think this novel is taking you places you’ve been before, Ward startles you with an image, a metaphor, a rhetorical surge that makes both Annis and her travails worth your attention. And admiration.",
        "bookRating": "3.6",
        "_id": "a9ebadfc-570c-43fc-a1fb-935f1d421050"
    },
    "7431d770-c3cc-4aea-baf5-a86dcd3a837d": {
        "bookTitle": "Memoirs of a Geisha",
        "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1409595968i/929.jpg",
        "Author": "Arthur Golden",
        "bookGenre": "Fiction",
        "bookReview": "Memoirs of a Geisha is an American novel, and as such the attempt at West does East, especially on the complex and delicate subject of the geisha, is compelling, interesting, but also heavy-handed and ultimately ineffective (even more so in the case of the film). It is a wonderful introduction to geisha, Japanese culture, and the East for the uninitiated Western reader, and I can see why the book is popular, but I found it disappointing. For the reader already familiar with the culture, western influences are all too clear and the book comes off as a bit clunky and imperfect. I also had some problems with the general perception of the characters by readers versus the way the characters were actually portrayed in the book--Memoirs is far from the good-willed fairy tale that people assume it is. By all means, read it, but leave it open for critique and remember that a more authentic representation of eastern culture, especially in the details, will come from the east itself.A lot of my critique stems from the fact that this movie has attained such wide-spread fame and been made into a movie, to be sure. I feel like it is being perpetuated as something it is not. Even the introduction to the book (a faux translator's note) perpetuates the myth that Memoirs is an accurate, beautiful, in-depth reflection of the life of a geisha, when in truth it is no more that historical fiction and is written by an outsider. Golden has done his research and is well-educated on his subjects, and I have no problem with people reading from, taking interest in, and even learning from this book; I do, however, think it is important that readers don't conflate the American novel with Japanese reality. They aren't the same thing, no matter how much research Golden did, and if we take the book as an accurate representation we're actually underestimating and undervaluing geisha, Japan, and Japanese culture.",
        "bookRating": "4.3",
        "_id": "7431d770-c3cc-4aea-baf5-a86dcd3a837d"
    }
    
}
